import Foundation
//შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი.
var number = 19
var number2 = 29
var number3 = 24
print (number * number2 * number3)


//შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით.
var myNumber = 15
let endNumber = myNumber % 2 > 0 ? "კენტია":"ლუწია"


/*. შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ*/
var myName: String? = "Elene"
if let myName {
    print(myName)
}


// შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება
var isRaining: Bool = true
if isRaining == true {
    print("ქოლგის წაღება არ დამავიწყდეს")
}
else {
    print("დღეს ქოლგა არ დამჭირდება")
}


/*შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”*/
var a = 3
var b = 7
if a > b {
    print("a მეტია")
}
else {
    print("b მეტია")
}


// შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.
let firsLetter: Character = "E"

//მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი
var twoDig = 77
let resultNum = twoDig % 11 == 0 ? "შემდგარია ერთიდაიმავე ციფრისგან":"არ არის შემდგარი ერთიდაიმავე ციფრისგან"


/* აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად*/
var numberOfMonths = 12
if numberOfMonths <= 2 || numberOfMonths >= 12 {
    print("ზამთარი")
} else if numberOfMonths >= 3 && numberOfMonths <= 5 {
    print("გაზაფხული")
} else if numberOfMonths >= 6 && numberOfMonths <= 8 {
    print("ზაფხული")
} else {
    print("შემოდგომა")
}
             

/*
 შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”
 */
var isNumber = 12
if isNumber % 3 == 0 && isNumber % 4 == 0 {
    print("იყოფა 3-ზე და 4-ზე")
} else if isNumber % 3 == 0 {
    print("იყოფა 3-ზე")
} else if isNumber % 4 == 0 {
    print("იყოფა 4-ზე")
}
    
/*შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი */
var num1 = -4
var num2 = 4
var distance = abs(num1) == abs(num2) ? "თანაბრად დაშორებულია":"არ არის თანაბრად დაშორებული ნულიდან"
print(distance)

